{
  "js":    
"Title: Building Your Own JavaScript Framework: Architect extensible and reusable framework systems\nAuthor: Vlad Filippov\n\nKey benefits\n- Explore the gateway to the constantly evolving world of JavaScript frameworks\n- Navigate the JavaScript development landscape and discover crucial software architecture patterns\n- Build your own framework for a variety of work-related projects\n- Purchase of the print or Kindle book includes a free PDF eBook\n\nDescription\n\nJavaScript frameworks play an essential role in web application development; however, no single framework works perfectly for all projects. This book will help you understand existing projects, design new software architecture, and maintain projects as they grow. You’ll go through software architecture principles with JavaScript, along with a guided example of structuring your project and maintenance guidance. This book covers framework planning aspects, enabling you to identify key stakeholders, understand JavaScript API design, and leverage complex abstraction. The second part of the book takes a practical programming approach to building your own framework by showing you how to structure modules and interfaces. As you advance, you’ll discover how to develop data-binding components, work with JavaScript APIs, and much more. While writing a framework is half the job, continuing to develop it requires effort from everyone involved. The concluding chapters help to achieve this by teaching you the crucial aspects of software maintenance and highlighting the constants of framework development. By the end of this book, you’ll have gained a clear understanding of the JavaScript framework landscape, along with the ability to build frameworks for your use cases.\n\nWho is this book for?\n\nIf you’re a JavaScript novice or an expert who wants to explore the world of JavaScript frameworks, this book is for you. This book introduces you to the history of frontend frameworks and guides you through the creation of your own framework. The chapters are designed to help developers build large projects for their full-time jobs and programmers who want to create open-source projects. A clear understanding of the JavaScript programming language as well as experience with existing software frameworks are all prerequisites.\n\nWhat you will learn\n- Expand your knowledge of JavaScript frameworks within different runtimes and ecosystems\n- Get to grips with the technical aspects of structuring framework abstractions in JavaScript\n- Gain an understanding of common patterns across various existing frameworks\n- Discover the usage of existing tooling such as TypeScript and GraphQL\n- Configure performance tests for your project and track down bottlenecks in the code base\n- Understand how JavaScript and the web evolve and what these systems will look like in the coming years",
  "azure": "Azure Data and AI Architect Handbook: Adopt a structured approach to designing data and AI solutions at scale on Microsoft Azure\nAuthors: Olivier Mertens, Breght Van Baelen\nKey benefits\n- Translate and implement conceptual architectures with the right Azure services\n- Inject artificial intelligence into data solutions for advanced analytics\n- Leverage cloud computing and frameworks to drive data science workloads\n\nDescription\n\nWith data’s growing importance in businesses, the need for cloud data and AI architects has never been higher. The Azure Data and AI Architect Handbook is designed to assist any data professional or academic looking to advance their cloud data platform designing skills. This book will help you understand all the individual components of an end-to-end data architecture and how to piece them together into a scalable and robust solution. You’ll begin by getting to grips with core data architecture design concepts and Azure Data & AI services, before exploring cloud landing zones and best practices for building up an enterprise-scale data platform from scratch. Next, you’ll take a deep dive into various data domains such as data engineering, business intelligence, data science, and data governance. As you advance, you’ll cover topics ranging from learning different methods of ingesting data into the cloud to designing the right data warehousing solution, managing large-scale data transformations, extracting valuable insights, and learning how to leverage cloud computing to drive advanced analytical workloads. Finally, you’ll discover how to add data governance, compliance, and security to solutions. By the end of this book, you’ll have gained the expertise needed to become a well-rounded Azure Data & AI architect.\nWho is this book for?\nThis book is for anyone looking to elevate their skill set to the level of an architect. Data engineers, data scientists, business intelligence developers, and database administrators who want to learn how to design end-to-end data solutions and get a bird’s-eye view of the entire data platform will find this book useful. Although not required, basic knowledge of databases and data engineering workloads is recommended.\n\nWhat you will learn\n\n- Design scalable and cost-effective cloud data platforms on Microsoft Azure\n- Explore architectural design patterns with various use cases\n- Determine the right data stores and data warehouse solutions\n- Discover best practices for data orchestration and transformation\n- Help end users to visualize data using interactive dashboarding\n- Leverage OpenAI and custom ML models for advanced analytics\n- Manage security, compliance, and governance for the data estate"
}
